[
  {
    "id": "exp-01",
    "title": "gridscape",
    "tags": [
      "AI",
      "Creative Writing",
      "Knowledge Graph"
    ],
    "tokens": 12500,
    "link": "https://gridscape-1017582726454.us-west1.run.app/",
    "text": "Gridscape turns research and ideation from a conversation into a map. Instead of asking questions and getting answers in a single thread, you draw rectangles on an infinite canvas. Each rectangle becomes a node of synthesized knowledge, and each connection between nodes includes an explicit bridge of reasoning. You end up with a spatial document that shows not just what you've explored but how the ideas relate to each other.\n\nThe interface uses ASCII schematics to visualize conceptual relationships, giving it a lo-fi, almost archival quality. This isn't just an aesthetic choice. It frames the output as working drafts rather than polished answers. Every node can have multiple versions. Every link explains why it exists.\n\nThe result is a different way of thinking with AI. You're not prompting a chatbot, you're navigating a landscape. Draw a frame to synthesize something new. Follow a suggested path or make your own. The canvas grows with you and lets you get productively lost in the process.",
    "images": [
      0,
      1,
      2
    ],
    "video": "01.mp4"
  },
  {
    "id": "exp-02",
    "title": "worldwide",
    "tags": [
      "Geolocation",
      "Tactical",
      "Game"
    ],
    "tokens": 9800,
    "link": "https://worldwide-696629161862.us-west1.run.app/",
    "text": "Worldwide transforms geography into an intelligence mission. Each round drops you into a global reconnaissance scenario where three cryptic clues point to a hidden country. The clues range from cultural facts and national symbols to environmental distinctions and historical quirks, challenging you to connect seemingly disparate pieces of information to pinpoint the correct territory on an interactive world map.\n\nThe gameplay balances strategy with intuition. As you hover across countries on the dark, tactical map interface, a proximity meter signals how close you are to the target, shifting from red to green as you approach the answer. You have three attempts to lock in your guess, and each wrong selection reveals additional intelligence to help narrow down the location. The tension builds as tries dwindle and the clock ticks, turning each round into a race against both time and your own geographic blind spots.\n\nWhether you are brushing up on world knowledge solo or challenging friends to see who can decode the intel faster, Worldwide makes learning about countries genuinely engaging. It is a game that rewards curiosity and pattern recognition, turning obscure facts about national dress codes, carbon footprints, and mythical nicknames into memorable moments of discovery.",
    "images": [
      0,
      1,
      2
    ],
    "video": "02.mp4"
  },
  {
    "id": "exp-03",
    "title": "flickbook",
    "tags": [
      "Movies",
      "Art"
    ],
    "tokens": 15200,
    "link": "https://flickbook-613508367596.us-west1.run.app/",
    "text": "Flickbook transforms your viewing history into a personal entertainment passport. Every movie and show you watch earns a unique, AI-generated stamp that gets added to your collection grid. Think of it as a visual diary of your screen time, where each stamp captures not just what you watched, but when you watched it.\n\nThe stamps are designed to evoke the nostalgia of travel passport stamps, with vintage typography, circular borders, and distinct visual motifs pulled from each title. Google Gemini generates these stamps in real time, creating artwork that feels both personal and collectible. Over time, your Flickbook becomes a beautiful archive of your cinematic journey.\n\nFlickbook turns passive consumption into something tangible. Instead of a forgettable list buried in an app, you get a curated gallery of memories. Share your passport with friends, compare collections, or simply scroll through the stamps and remember why you loved each watch.",
    "images": [
      0,
      1,
      2
    ],
    "video": "03.mp4"
  },
  {
    "id": "exp-04",
    "title": "elemental",
    "tags": [
      "Science",
      "AI",
      "Knowledge Graph"
    ],
    "tokens": 11200,
    "link": "https://atomic-grid-interactive-periodic-table-69725660120.us-west1.run.app/",
    "text": "Elemental began as a simple question: what if the periodic table could answer back? Instead of memorizing elements in isolation, I wanted to build something that lets you explore chemistry the way scientists actually think about it. Start with a material you encounter every day, ask what it's made of, and watch the fundamental building blocks reveal themselves. The reverse search flips the traditional approach on its head, turning passive learning into active discovery.\n\nThe physics simulations emerged from a desire to make abstract concepts feel tangible. When irrelevant elements fall away during a search, it's not just a visual trick. It's a reminder that chemistry is about relationships and reactions, not static facts on a chart. The element relationships feature takes this further, letting you pair any two elements and explore how they bond, what compounds they form, and where those materials show up in the real world. Zirconium and boron might seem obscure until you learn they combine to create materials that survive 2000 degrees Celsius in jet engines.\n\nThis project is an ongoing experiment in making science more intuitive. Every feature is designed around a simple principle: understanding emerges from interaction, not instruction. Whether you're a student trying to grasp why sodium reacts violently with water or just curious about what's inside your phone screen, Elemental aims to turn that curiosity into genuine comprehension. The periodic table is a map of everything that exists. This app is an attempt to make that map worth exploring.",
    "images": [
      0,
      1,
      2
    ],
    "video": "04.mp4"
  },
  {
    "id": "exp-05",
    "title": "canopy",
    "tags": [
      "Visualization",
      "Movies",
      "TV"
    ],
    "tokens": 13400,
    "link": "https://canopy-271967923745.us-west1.run.app/",
    "text": "Canopy is an interactive visualization that maps the hidden architecture of cinema. Enter any actor, director, composer, or film title and watch as a procedural tree grows from your query, its branches tracing the web of collaborations and creative connections that define the industry. Each node represents a person or a film, and clicking any node reveals its metadata while letting you re-root the entire tree from that new perspective.\n\nThe visual language borrows from data art and generative design. A left panel exposes the underlying parameters that control how the tree grows: branch angles, length variance, scale reduction, node sizing. You can manipulate these in real time, watching the structure reorganize itself. The aesthetic is deliberately monochromatic and technical, treating film industry data with the same visual rigor as a botanical diagram.\n\nWhat emerges is something like a family tree for cinema. Search for Christopher Nolan and see his filmography branch outward, each film spawning clusters of collaborators who connect to their other works. The tree makes visible what we intuitively know but rarely see mapped: that cinema is a dense network of relationships, and every film exists within a living ecosystem of creative partnerships.",
    "images": [
      0,
      1,
      2
    ],
    "video": "06.mp4"
  },
  {
    "id": "exp-06",
    "title": "wanderword",
    "tags": [
      "Language",
      "Maps",
      "Visualization"
    ],
    "tokens": 15600,
    "link": "https://wanderword-141284551734.us-west1.run.app/",
    "text": "Every word you speak is a traveler. Wanderword visualizes the hidden migrations of language, tracing how words journeyed across continents through trade routes, conquests, and cultural exchange. Type any word and watch its path unfold on an interactive world map. The tea in your cup tells two stories: one that traveled by Dutch ships from Fujian province, becoming \"tea\" across maritime Europe, and another that moved overland through the Silk Road, transforming into \"chai\" across Persia and India.\n\nPowered by Gemini, the app reconstructs the linguistic archaeology of everyday words. Each query returns precise coordinates, century markers, and phonetic transformations as words morphed through dozens of languages. Words like \"orange\" show their scars: the missing \"n\" that dropped somewhere between Arabic \"naranj\" and French \"orange.\" Coffee remembers the Ethiopian highlands. Algorithm carries the name of a 9th century Persian mathematician in its very syllables.\n\nLanguage becomes landscape, and every word becomes a map of human connection across time and space.",
    "images": [
      0,
      1,
      2
    ],
    "video": "07.mp4"
  },
  {
    "id": "exp-07",
    "title": "kickoff'26",
    "tags": [
      "Sports",
      "Visualization",
      "Data"
    ],
    "tokens": 14200,
    "link": "https://kickoff-26-1082422747084.us-west1.run.app/",
    "text": "Kickoff’26 acts as a comprehensive digital repository for World Cup history. It uses a visual language of vintage cartography to present global football statistics through an interactive map interface. By marrying classic archival aesthetics with modern data processing, the platform offers a unique way to traverse nearly a century of tournament records from 1930 to the present day.\n\nThe interface provides specialized viewing modes to explore distinct aspects of the sport, including championship distributions and squad demographics. Users navigate a responsive map to access specific national records or view historical stadium locations across the globe. An integrated intelligence layer processes natural language queries to surface specific facts or narrative summaries from the extensive database instantly based on user intent.\n\nA central feature of the experience is the generation of period accurate stadium blueprints that appear as technical drafting sketches on aged paper. Beyond simple numbers, the application offers tactical matrices that visualize team performance through high density data stacks and historical goal yield analysis. This combination of historical storytelling and technical analysis establishes the platform as a definitive digital atlas for the evolution of the global game.",
    "images": [
      0,
      1,
      2
    ],
    "video": "09.mp4"
  },
  {
    "id": "exp-08",
    "title": "starweave",
    "text": "Starweave is an interactive data visualization experience that maps the history of exoplanet discovery as a living, DNA-like strand. Built to transform raw scientific data into a kinetic timeline, it traces the chronological path of human discovery from the first pulsar planets of 1992 to the recent atmospheric studies by the James Webb Space Telescope. Every node on the strand represents a real, confirmed world found beyond our solar system, creating a continuous \"geometric signature\" of our unfolding knowledge of the Milky Way.\n\nThe interface invites users to explore the galaxy's history through distinct visual data points. Vertical bars extend from the timeline to indicate a planet's distance from Earth in parsecs, while a color-coded system identifies the detection method used—whether by Transit, Radial Velocity, or Direct Imaging. Interactive filters allow users to isolate specific categories of celestial bodies, such as \"Habitable Zone\" candidates, massive \"Cosmic Giants,\" or complex multi-planet systems described as \"Alien Archipelagos.\"\n\nBeneath the primary visualization lies a sophisticated procedural design engine. A generative background field flows like a topographic map to create depth, while the application’s footer dynamically renders the \"Planetary Architecture\" of any selected system. Using a custom wireframe rendering technique, Starweave generates unique, scale-appropriate visualizations of planetary orbits and ring systems on the fly, offering a high-fidelity window into the structural diversity of our galactic neighborhood.",
    "tags": [
      "Visualization",
      "Science",
      "Space"
    ],
    "images": [
      0,
      1,
      2
    ],
    "tokens": 11677,
    "link": "https://starweave-696629161862.us-west1.run.app/",
    "video": "11.mp4"
  },
  {
    "id": "exp-09",
    "title": "brewprint",
    "text": "Brewprint is an interactive design application that reimagines beverage exploration by blending a raw, industrial aesthetic with advanced generative AI. It transforms simple drink queries into beautifully detailed, \"artisanal\" product labels that look like vintage specification sheets. The interface opens with a unique \"scrapbook\" style landing page, featuring a masonry grid of curated drink inspirations and category filters, all set against a backdrop of clean typography, high-contrast design elements, and a stark, brutalist visual language.\n\nBeyond standard recipes, Brewprint generates a comprehensive \"identity\" for every drink using Google's Gemini models. Each generated label includes a rich narrative with a handwritten-style process description, a fascinating origin story, and a precise ingredient specification table. It visually analyzes the drink's character through a dynamic radar chart representing its flavor profile and provides a \"Pairing Matrix\" that suggests specific audio tracks, foods, and occasions to curate the perfect atmosphere for consumption.\n\nThe user experience is designed to feel like discovering a page from a master distiller's secret logbook. From the educational trivia displayed during the \"brewing\" phase to the final reveal, the app is fluid and immersive. It culminates in a generated card complete with a custom AI-generated continuous line drawing, \"verified batch\" stamps, and decorative textures, offering mixology enthusiasts and design lovers a visually stunning way to discover the science and soul behind their favorite spirits, beers, and cocktails.",
    "tags": [
      "Generative",
      "Entertainment"
    ],
    "images": [
      0,
      1,
      2
    ],
    "tokens": 17829,
    "link": "https://brewprint-1053595248236.us-west1.run.app/",
    "video": "12.mp4"
  },
  {
    "id": "exp-10",
    "title": "goodflix",
    "text": "Goodflix is an immersive movie discovery platform designed to combat decision fatigue through a visually stunning 3D interface. Instead of the traditional 2D grid found on most streaming services, the application presents movie posters on an interactive, infinite cylindrical carousel rendered with Three.js and custom WebGL shaders. This tactile browsing experience allows users to effortlessly spin through popular, top-rated, and upcoming titles sourced from The Movie Database (TMDB), all wrapped in a sleek, dark-mode aesthetic with high-contrast, editorial-style typography.\nAt the heart of the application is a powerful \"vibe-based\" search engine driven by the Google Gemini API. Rather than just searching by title or genre, users can input natural language queries or select from curated mood chips—such as \"Neon Noir,\" \"Dystopian Future,\" or \"Just had a breakup.\" The AI interprets these abstract concepts to generate a tailored list of 48 relevant movie titles, dynamically repopulating the 3D cylinder. To further engage the user during data fetching, Gemini generates and displays obscure, fascinating trivia facts related to the specific search context in real-time.",
    "tags": [
      "Entertainment",
      "Gallery",
      "Visualization"
    ],
    "images": [],
    "tokens": 0,
    "link": "https://goodflix-613508367596.us-west1.run.app/",
    "video": "13.mp4"
  },
  {
    "id": "exp-11",
    "title": "dinodraft",
    "text": "Dino-Draft is an immersive, technical visualization tool designed to simulate a high-tech paleontological field survey. It aggregates global fossil data into a stylized \"blueprint\" interface, allowing users to explore the prehistoric world through the lens of a researcher. The application transforms raw data into a cohesive dossier, presenting detailed records of dinosaur species—ranging from the Tyrannosaurus Rex to the Microraptor—in a distinctively tactical, manila-folder aesthetic.\n\nAt the heart of the experience is an interactive, D3-powered global map that acts as a central command hub. Users navigate through geological formations—from the Hell Creek Formation to the Gobi Desert—using a responsive coordinate system. Selected sites pulse with a custom sonar-like ripple effect, visually anchoring the user to specific excavation points while providing immediate geographic context. The interface emphasizes technical precision, utilizing typewriter fonts and vector-style iconography to maintain the atmosphere of a classified scientific archive.\n\nThe application leverages the power of the Google Gemini API to dynamically generate high-fidelity, monochromatic scientific illustrations for each species, rendering them as \"schematic blueprints\" in real-time. Beyond visuals, the system breaks down complex paleontological data into digestible metrics, including threat levels, osteological completeness, and geological context. This combination of generative AI, rich datasets, and atmospheric UI creates a unique educational platform that feels less like a textbook and more like a field operative's terminal.",
    "tags": [
      "Maps",
      "Visualization",
      "History"
    ],
    "images": [
      0,
      1,
      2
    ],
    "tokens": 15790,
    "link": "https://dino-draft-271967923745.us-west1.run.app/",
    "video": "14.mp4"
  },
  {
    "id": "exp-12",
    "title": "warpfield",
    "text": "Warp Field is an interactive particle simulation that transforms static grids into fluid, reactive geometry. Built with React and p5.js, the application renders a field of thousands of individual points—customizable as simple dots, ASCII characters, or binary code—that respond dynamically to cursor movement. Users can manipulate a distortion lens that ripples through the grid, creating organic, topographic patterns that mimic physical displacement forces in real-time.\n\nThe experience is elevated through a sophisticated audio-reactive engine powered by the Web Audio API. By analyzing frequency data, the grid visualizes sound as physical force: sub-bass frequencies generate a rotating vortex and propagating sine waves from the center, while high-frequency transients introduce jitter and kinetic energy. During intense musical moments, a dynamic \"constellation\" algorithm activates, drawing transient wireframe connections between neighboring particles to create complex, pulsing geometric structures synchronized to the beat.\n\nDesigned with a brutalist, high-contrast aesthetic, the interface provides deep control over the simulation's physics. Users can fine-tune the damping factor to switch between rigid, snappy motion and liquid, viscous flows, adjust the chaos level of the distortion, and select from curated color palettes to tint the particle field. Whether used as a meditative visualizer or a high-energy graphics experiment, Warp Field offers a playground for exploring the intersection of code, math, and music.\n",
    "tags": [
      "Simulation",
      "Visualization"
    ],
    "images": [
      0,
      1,
      2
    ],
    "tokens": 13478,
    "link": "https://warp-field-1082422747084.us-west1.run.app/",
    "video": "15.mp4"
  },
  {
    "id": "exp-13",
    "title": "shape of you",
    "text": "\"The Shape of You\" is an immersive typographic video mirror designed to transform personal connections into digital art for Valentine's Day. By utilizing real-time webcam processing, the application deconstructs the user’s silhouette and reconstructs it using dynamic text characters, creating a \"living letter\" effect. The minimalist, high-contrast aesthetic—driven by elegant typography like Londrina Solid and Gilda Display—allows users to see themselves rendered through the very words they wish to convey, turning a standard video feed into a poetic visual performance.\n\nThe app offers deep customization through four distinct text modes, enabling users to choose between romantic heart symbols, custom typed messages, or song lyrics. A standout feature is the integration of the Gemini AI API, which allows users to search for any song and instantly fetch its lyrics to serve as the visual \"ink\" for their silhouette. Users can further fine-tune the visualization using a \"Light Threshold\" slider, which adjusts the density and sensitivity of the typographic rendering based on the environment's lighting, ensuring a crisp and personalized aesthetic.\n\nBuilt on a robust technical foundation of React and p5.js, the application captures the ephemeral nature of these interactions with an integrated recording system. Beyond just a visual mirror, it functions as a creative production tool where users can record their typographic transformations along with synchronized audio. ",
    "tags": [
      "Visualization",
      "Media"
    ],
    "images": [
      0,
      1,
      2
    ],
    "tokens": 15600,
    "link": "https://the-shape-of-you-247949494736.us-west1.run.app/",
    "video": "13.mp4"
  }
]