[
  {
    "id": "exp-01",
    "title": "gridscape",
    "tags": [
      "AI",
      "Creative Writing",
      "Knowledge Graph"
    ],
    "tokens": 12500,
    "link": "https://gridscape-1017582726454.us-west1.run.app/",
    "text": "Gridscape turns research and ideation from a conversation into a map. Instead of asking questions and getting answers in a single thread, you draw rectangles on an infinite canvas. Each rectangle becomes a node of synthesized knowledge, and each connection between nodes includes an explicit bridge of reasoning. You end up with a spatial document that shows not just what you've explored but how the ideas relate to each other.\n\nThe interface uses ASCII schematics to visualize conceptual relationships, giving it a lo-fi, almost archival quality. This isn't just an aesthetic choice. It frames the output as working drafts rather than polished answers. Every node can have multiple versions. Every link explains why it exists.\n\nThe result is a different way of thinking with AI. You're not prompting a chatbot, you're navigating a landscape. Draw a frame to synthesize something new. Follow a suggested path or make your own. The canvas grows with you and lets you get productively lost in the process.",
    "images": [
      0,
      1,
      2
    ],
    "video": "01.mp4"
  },
  {
    "id": "exp-02",
    "title": "worldwide",
    "tags": [
      "Geolocation",
      "Tactical",
      "Game"
    ],
    "tokens": 9800,
    "link": "https://worldwide-696629161862.us-west1.run.app/",
    "text": "Worldwide transforms geography into an intelligence mission. Each round drops you into a global reconnaissance scenario where three cryptic clues point to a hidden country. The clues range from cultural facts and national symbols to environmental distinctions and historical quirks, challenging you to connect seemingly disparate pieces of information to pinpoint the correct territory on an interactive world map.\n\nThe gameplay balances strategy with intuition. As you hover across countries on the dark, tactical map interface, a proximity meter signals how close you are to the target, shifting from red to green as you approach the answer. You have three attempts to lock in your guess, and each wrong selection reveals additional intelligence to help narrow down the location. The tension builds as tries dwindle and the clock ticks, turning each round into a race against both time and your own geographic blind spots.\n\nWhether you are brushing up on world knowledge solo or challenging friends to see who can decode the intel faster, Worldwide makes learning about countries genuinely engaging. It is a game that rewards curiosity and pattern recognition, turning obscure facts about national dress codes, carbon footprints, and mythical nicknames into memorable moments of discovery.",
    "images": [
      0,
      1,
      2
    ],
    "video": "02.mp4"
  },
  {
    "id": "exp-03",
    "title": "flickbook",
    "tags": [
      "Movies",
      "Art"
    ],
    "tokens": 15200,
    "link": "https://flickbook-613508367596.us-west1.run.app/",
    "text": "Flickbook transforms your viewing history into a personal entertainment passport. Every movie and show you watch earns a unique, AI-generated stamp that gets added to your collection grid. Think of it as a visual diary of your screen time, where each stamp captures not just what you watched, but when you watched it.\n\nThe stamps are designed to evoke the nostalgia of travel passport stamps, with vintage typography, circular borders, and distinct visual motifs pulled from each title. Google Gemini generates these stamps in real time, creating artwork that feels both personal and collectible. Over time, your Flickbook becomes a beautiful archive of your cinematic journey.\n\nFlickbook turns passive consumption into something tangible. Instead of a forgettable list buried in an app, you get a curated gallery of memories. Share your passport with friends, compare collections, or simply scroll through the stamps and remember why you loved each watch.",
    "images": [
      0,
      1,
      2
    ],
    "video": "03.mp4"
  },
  {
    "id": "exp-04",
    "title": "elemental",
    "tags": [
      "Science",
      "AI",
      "Knowledge Graph"
    ],
    "tokens": 11200,
    "link": "https://atomic-grid-interactive-periodic-table-69725660120.us-west1.run.app/",
    "text": "Elemental began as a simple question: what if the periodic table could answer back? Instead of memorizing elements in isolation, I wanted to build something that lets you explore chemistry the way scientists actually think about it. Start with a material you encounter every day, ask what it's made of, and watch the fundamental building blocks reveal themselves. The reverse search flips the traditional approach on its head, turning passive learning into active discovery.\n\nThe physics simulations emerged from a desire to make abstract concepts feel tangible. When irrelevant elements fall away during a search, it's not just a visual trick. It's a reminder that chemistry is about relationships and reactions, not static facts on a chart. The element relationships feature takes this further, letting you pair any two elements and explore how they bond, what compounds they form, and where those materials show up in the real world. Zirconium and boron might seem obscure until you learn they combine to create materials that survive 2000 degrees Celsius in jet engines.\n\nThis project is an ongoing experiment in making science more intuitive. Every feature is designed around a simple principle: understanding emerges from interaction, not instruction. Whether you're a student trying to grasp why sodium reacts violently with water or just curious about what's inside your phone screen, Elemental aims to turn that curiosity into genuine comprehension. The periodic table is a map of everything that exists. This app is an attempt to make that map worth exploring.",
    "images": [
      0,
      1,
      2
    ],
    "video": "04.mp4"
  },
  {
    "id": "exp-05",
    "title": "stemwise",
    "tags": [
      "AI",
      "Creative",
      "Journal"
    ],
    "tokens": 8700,
    "link": "https://example.com/exp-05",
    "text": "Stemwise is a journaling app that speaks back in plants instead of words. You write what's on your mind and AI finds a botanical match for your emotional state. A moment of resilience might become a fern. A breakthrough could bloom into something flowering. Each reflection generates a unique Victorian-style botanical illustration, hand-drawn and imperfect, like something from a naturalist's field journal.\n\nOver time, your entries grow into a digital garden that accumulates left to right, chronologically. Hover over any plant and the memory returns. The app doesn't analyze or advise. It just listens and gives you something living in return. Growth becomes something you can actually see, not as metrics or streaks, but as an organic landscape shaped by your own inner weather.\n\nThe idea came from wanting a different relationship with journaling. Less productivity tool, more quiet ritual. A place where thoughts don't need to be optimized or resolved. They just get planted, and you move on. Sometimes the right metaphor says more than any analysis could.",
    "images": [
      0,
      1,
      2
    ]
  },
  {
    "id": "exp-06",
    "title": "canopy",
    "tags": [
      "Visualization",
      "Movies",
      "TV"
    ],
    "tokens": 13400,
    "link": "https://example.com/exp-06",
    "text": "Canopy is an interactive visualization that maps the hidden architecture of cinema. Enter any actor, director, composer, or film title and watch as a procedural tree grows from your query, its branches tracing the web of collaborations and creative connections that define the industry. Each node represents a person or a film, and clicking any node reveals its metadata while letting you re-root the entire tree from that new perspective.\n\nThe visual language borrows from data art and generative design. A left panel exposes the underlying parameters that control how the tree grows: branch angles, length variance, scale reduction, node sizing. You can manipulate these in real time, watching the structure reorganize itself. The aesthetic is deliberately monochromatic and technical, treating film industry data with the same visual rigor as a botanical diagram.\n\nWhat emerges is something like a family tree for cinema. Search for Christopher Nolan and see his filmography branch outward, each film spawning clusters of collaborators who connect to their other works. The tree makes visible what we intuitively know but rarely see mapped: that cinema is a dense network of relationships, and every film exists within a living ecosystem of creative partnerships.",
    "images": [
      0,
      1,
      2
    ],
    "video": "06.mp4"
  },
  {
    "id": "exp-07",
    "title": "wanderword",
    "tags": [
      "Language",
      "Maps",
      "Visualization"
    ],
    "tokens": 15600,
    "link": "https://example.com/exp-07",
    "text": "Every word you speak is a traveler. Wanderword visualizes the hidden migrations of language, tracing how words journeyed across continents through trade routes, conquests, and cultural exchange. Type any word and watch its path unfold on an interactive world map. The tea in your cup tells two stories: one that traveled by Dutch ships from Fujian province, becoming \"tea\" across maritime Europe, and another that moved overland through the Silk Road, transforming into \"chai\" across Persia and India.\n\nPowered by Gemini, the app reconstructs the linguistic archaeology of everyday words. Each query returns precise coordinates, century markers, and phonetic transformations as words morphed through dozens of languages. Words like \"orange\" show their scars: the missing \"n\" that dropped somewhere between Arabic \"naranj\" and French \"orange.\" Coffee remembers the Ethiopian highlands. Algorithm carries the name of a 9th century Persian mathematician in its very syllables.\n\nLanguage becomes landscape, and every word becomes a map of human connection across time and space.",
    "images": [
      0,
      1,
      2
    ],
    "video": "07.mp4"
  },
  {
    "id": "exp-08",
    "title": "lexoscope",
    "tags": [
      "Writing",
      "Visualization",
      "Data"
    ],
    "tokens": 11800,
    "link": "https://example.com/exp-08",
    "text": "Lexoscope functions as a digital laboratory designed to reveal the invisible structures buried within written language. It moves beyond simple word counts and readability scores by using advanced heuristics and algorithmic visualization to treat text as a physical specimen. By pasting an article or a note into the clean interface, writers and researchers can observe the soul of their work through multiple scientific lenses that highlight patterns often missed by the human eye during the normal process of reading.\n\nOne of the most distinctive features is the Ancestry Forest, which maps the etymological origins of a writer's vocabulary in a stunning radial display. This visualization categorizes words into their linguistic roots such as Germanic, Latin, or Greek and arranges them across historical rings of data. This capability allows creators to understand the inherent density of their prose and see whether they are relying on the blunt force of ancient roots or the intricate precision of more modern classical derivations.",
    "images": [
      0,
      1,
      2
    ],
    "video": "08.mp4"
  },
  {
    "id": "exp-09",
    "title": "kickoff'26",
    "tags": [
      "Sports",
      "Visualization",
      "Data"
    ],
    "tokens": 14200,
    "link": "https://example.com/exp-09",
    "text": "Kickoff’26 acts as a comprehensive digital repository for World Cup history. It uses a visual language of vintage cartography to present global football statistics through an interactive map interface. By marrying classic archival aesthetics with modern data processing, the platform offers a unique way to traverse nearly a century of tournament records from 1930 to the present day.\n\nThe interface provides specialized viewing modes to explore distinct aspects of the sport, including championship distributions and squad demographics. Users navigate a responsive map to access specific national records or view historical stadium locations across the globe. An integrated intelligence layer processes natural language queries to surface specific facts or narrative summaries from the extensive database instantly based on user intent.\n\nA central feature of the experience is the generation of period accurate stadium blueprints that appear as technical drafting sketches on aged paper. Beyond simple numbers, the application offers tactical matrices that visualize team performance through high density data stacks and historical goal yield analysis. This combination of historical storytelling and technical analysis establishes the platform as a definitive digital atlas for the evolution of the global game.",
    "images": [
      0,
      1,
      2
    ],
    "video": "09.mp4"
  },
  {
    "id": "exp-10",
    "title": "reverb",
    "tags": [
      "Music",
      "Visualization",
      "Data"
    ],
    "tokens": 9600,
    "link": "https://example.com/exp-10",
    "text": "Reverb is a specialized visualization engine designed to reveal the hidden structural patterns within musical compositions. By deconstructing song lyrics into discrete color-coded blocks, the application transforms a linear text into a high-density data mosaic. This approach allows listeners to see the rhythmic architecture of a track and observe how verses and choruses physically manifest as repeating patterns of light and color. The project aims to provide a new lens for musical analysis where repetition is not just heard but visually mapped as a unique digital fingerprint.\n\nThe underlying technology leverages advanced processing to calculate real-time metrics such as the unique lexicon and the cumulative echo rate. Using a deterministic masking algorithm, each word block receives a distinct visual texture that remains stable across different viewing sessions. Color plays a vital role in this experience as it denotes the specific point in time when a word first entered the song vocabulary. This temporal mapping makes it easy to distinguish between the introductory building blocks of a track and the later sections that rely on established lyrical themes.\n\nBeyond raw data analysis, the interface encourages deep exploration through interactive elements that spotlight specific word frequencies and origins. Users can engage with a dynamic subject monitor that tracks every movement across the lyric grid while the system generates high-quality visual signatures. The final experience culminates in a shareable poster that summarizes the entire song as a single artistic artifact. This blend of technical rigorousness and aesthetic beauty turns standard metadata into a permanent visual record of a song's creative DNA.",
    "images": [
      0,
      1,
      2
    ],
    "video": "10.mp4"
  },
  {
    "id": "exp-11",
    "title": "starweave",
    "text": "Enter experiment description here...",
    "tags": [],
    "images": [],
    "tokens": 0,
    "link": "https://example.com"
  },
  {
    "id": "exp-12",
    "title": "brewprint",
    "text": "Enter experiment description here...",
    "tags": [],
    "images": [],
    "tokens": 0,
    "link": "https://brewprint-1053595248236.us-west1.run.app/",
    "video": "12.mp4"
  },
  {
    "id": "exp-13",
    "title": "goodflix",
    "text": "Enter experiment description here...",
    "tags": [],
    "images": [],
    "tokens": 0,
    "link": "https://goodflix-613508367596.us-west1.run.app/",
    "video": "13.mp4"
  },
  {
    "id": "exp-14",
    "title": "dinodraft",
    "text": "Enter experiment description here...",
    "tags": [],
    "images": [],
    "tokens": 0,
    "link": "https://dino-draft-271967923745.us-west1.run.app/"
  },
  {
    "id": "exp-15",
    "title": "warpfield",
    "text": "Enter experiment description here...",
    "tags": [],
    "images": [],
    "tokens": 0,
    "link": "https://warp-field-1082422747084.us-west1.run.app/",
    "video": "15.mp4"
  }
]